// Вывести на экран числа от -N до N
int i=-15;
int N=15;
while(i<=N)
{
    if(i%1==0)
    {
    System.Console.Write($"{i}, ");
    }
    i++;
}
